DataProcessors/csys1_ГрафикОтпусковСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>csys1_ГрафикОтпусковСотрудников</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСохраненныхДатОтпуска</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбранныйГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/csys1_ДатыОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>csys1_ДатыОтпусков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОтпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/csys1_ГрафикОтпусковСотрудников/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем СписокВыбранныхДат; 

&НаКлиенте
Перем БлокировкаИзменения;  

&НаКлиенте
Перем КалендарьИзменен; 

&НаКлиенте
Перем ТекущийПользователь;

&НаКлиенте
Перем ПривелегированныйПользователь;


&НаКлиенте
Процедура КалендарьПриИзменении(Элемент)
	
	Если БлокировкаИзменения = Истина Тогда
		Возврат;
	КонецЕсли;

	Если СписокВыбранныхДат = Неопределено Тогда
		СписокВыбранныхДат = Новый СписокЗначений;
	КонецЕсли;

	БлокировкаИзменения = Истина;

	ВыбраннаяДата = Календарь;
	
	Если Не ПривелегированныйПользователь Тогда
		Если ВыбраннаяДата < ТекущаяДата() Тогда
			Сообщение = "Изменение даты отпуска задним числом не возможно. Текущая дата: " + Формат(ТекущаяДата(), "ДЛФ=Д");
			Сообщить(Сообщение);
			ОбновитьВыделениеКалендаря(); 
			ОбновитьКоличествоВыбранныхДат();
			БлокировкаИзменения = Ложь;
			Возврат;	
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(ВыбраннаяДата) Тогда

		ЭлементСписка = СписокВыбранныхДат.НайтиПоЗначению(ВыбраннаяДата);

		Если ЭлементСписка = Неопределено Тогда
			СписокВыбранныхДат.Добавить(ВыбраннаяДата);
		Иначе
			СписокВыбранныхДат.Удалить(ЭлементСписка);
		КонецЕсли;

	КонецЕсли;

	ОбновитьВыделениеКалендаря(); 
	ОбновитьКоличествоВыбранныхДат();
	КалендарьИзменен = Истина;
    		
	БлокировкаИзменения = Ложь;

КонецПроцедуры

&НаСервере
Функция ПолучитьТекущегоПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Элементы.Календарь.НачалоПериодаОтображения = НачалоГода(ТекущаяДата());
	Элементы.Календарь.КонецПериодаОтображения = КонецГода(ТекущаяДата());
	ТекущийПользователь = ПолучитьТекущегоПользователя();
	ПривелегированныйПользователь = ВходитВМенеджерыПоПерсоналу(ТекущийПользователь);
                                                            

	Объект.Сотрудник = ПолучитьСотрудникаТекущегоПользователя();
	Объект.ВыбранныйГод = Год(ТекущаяДата());

	СписокВыбранныхДат =
    ПолучитьДатыОтпускаСотрудника(
        Объект.Сотрудник,
        Объект.ВыбранныйГод);
	ОбновитьПериодКалендаря();
	ОбновитьВыделениеКалендаря();
	ОбновитьКоличествоВыбранныхДат();
	КалендарьИзменен = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВыделениеКалендаря()

	Если СписокВыбранныхДат = Неопределено Тогда
		СписокВыбранныхДат = Новый СписокЗначений;
	КонецЕсли;

	Элементы.Календарь.ВыделенныеДаты.Очистить();

	МассивДат = СписокВыбранныхДат.ВыгрузитьЗначения();

	Для Каждого ТекущаяДата Из МассивДат Цикл
		Элементы.Календарь.ВыделенныеДаты.Добавить(ТекущаяДата);
	КонецЦикла;

	

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
ПроверитьИзмененияИОбновить();
Сообщить("TODO Реализовать проверку при закрытии");
	
КонецПроцедуры 

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьДатыОтпуска(
        Объект.Сотрудник,
        СписокВыбранныхДат,
        Объект.ВыбранныйГод);
		Сообщение = "График отпусков сохранен. Использованных дней отпуска: " + КоличествоВыбранныхДат;
		Сообщить(Сообщение);
		КалендарьИзменен = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ГодВперед(Команда)
	
	Объект.ВыбранныйГод = Объект.ВыбранныйГод + 1;
	
	Если Объект.ВыбранныйГод <> Год(ТекущаяДата()) Тогда
		Элементы.ВыбранныйГод.ЦветТекста = Новый Цвет(255,0,0);
	Иначе
		Элементы.ВыбранныйГод.ЦветТекста = Новый Цвет(0,0,0);
	КонецЕсли; 
	ОбновитьПериодКалендаря();
	ПроверитьИзмененияИОбновить();
КонецПроцедуры

&НаКлиенте
Процедура ГодНазад(Команда)
	
	Объект.ВыбранныйГод = Объект.ВыбранныйГод - 1;
	Если Объект.ВыбранныйГод <> Год(ТекущаяДата()) Тогда
		Элементы.ВыбранныйГод.ЦветТекста = Новый Цвет(255,0,0);
	Иначе
		Элементы.ВыбранныйГод.ЦветТекста = Новый Цвет(0,0,0);
	КонецЕсли;
	ОбновитьПериодКалендаря();
	ПроверитьИзмененияИОбновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИзмененияИОбновить()

    СписокВыбранныхДат =
        ПолучитьДатыОтпускаСотрудника(
            Объект.Сотрудник,
            Объект.ВыбранныйГод);
			
	ОбновитьПериодКалендаря();
    ОбновитьВыделениеКалендаря();
	ОбновитьКоличествоВыбранныхДат();

КонецПроцедуры
	
&НаСервере
Функция ПолучитьДатыОтпускаСотрудника(Сотрудник, ВыбранныйГод)

    Результат = Новый СписокЗначений;

    Если Не ЗначениеЗаполнено(Сотрудник) Тогда
        Возврат Результат;
    КонецЕсли;

    Запрос = Новый Запрос;

    Запрос.Текст =
    "ВЫБРАТЬ
    |   ДатыОтпусков.ДатаОтпуска КАК ДатаОтпуска
    |ИЗ
    |   РегистрСведений.csys1_ДатыОтпусков КАК ДатыОтпусков
    |ГДЕ
    |   ДатыОтпусков.Сотрудник = &Сотрудник
    |   И ДатыОтпусков.ДатаОтпуска МЕЖДУ &НачалоГода И &КонецГода
    |
    |УПОРЯДОЧИТЬ ПО
    |   ДатаОтпуска";

    Запрос.УстановитьПараметр(
        "Сотрудник",
        Сотрудник);

    Запрос.УстановитьПараметр(
        "НачалоГода",
        Дата(ВыбранныйГод,1,1));

    Запрос.УстановитьПараметр(
        "КонецГода",
        КонецДня(Дата(ВыбранныйГод,12,31)));

    Выборка = Запрос.Выполнить().Выбрать();

    Пока Выборка.Следующий() Цикл
        
        Результат.Добавить(
            НачалоДня(Выборка.ДатаОтпуска));

    КонецЦикла;

    Возврат Результат;

КонецФункции

&НаСервере
Функция ПолучитьСотрудникаТекущегоПользователя()
	ТекущийПользователь = ПолучитьТекущегоПользователя();
	
	Если Не ЗначениеЗаполнено(ТекущийПользователь) Тогда    
		Сообщить("Не удалось определить текущего пользователя.");
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	| Сотрудники.Ссылка КАК СотрудникСсылка,
	| Сотрудники.Наименование КАК Наименование,
	| Сотрудники.Физлицо КАК Физлицо
	| ИЗ
	| Справочник.Сотрудники КАК Сотрудники
	| ГДЕ
	| Наименование = &ИмяПользователя";
	
	Запрос.УстановитьПараметр("ИмяПользователя", ТекущийПользователь.Наименование);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.СотрудникСсылка;
	КонецЕсли;

	Сообщить("Для текущего пользователя не найден сотрудник.");
	Возврат Справочники.Сотрудники.ПустаяСсылка();

КонецФункции

&НаСервере
Процедура СохранитьДатыОтпуска(Сотрудник, СписокДат, ВыбранныйГод)

    Если Не ЗначениеЗаполнено(Сотрудник) Тогда
        Возврат;
    КонецЕсли;


    Набор = РегистрыСведений.csys1_ДатыОтпусков.СоздатьНаборЗаписей();
    Набор.Отбор.Сотрудник.Установить(Сотрудник);
    Набор.Прочитать();


    Индекс = Набор.Количество() - 1;

    Пока Индекс >= 0 Цикл

        Если Год(Набор[Индекс].ДатаОтпуска) = ВыбранныйГод Тогда
            Набор.Удалить(Индекс);
        КонецЕсли;
        Индекс = Индекс - 1;
    КонецЦикла;


    Для Каждого Элемент Из СписокДат Цикл
        Запись = Набор.Добавить();
        Запись.Сотрудник = Сотрудник;
        Запись.ДатаОтпуска = НачалоДня(Элемент.Значение);
    КонецЦикла;
    Набор.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоВыбранныхДат()
     Если СписокВыбранныхДат = Неопределено Тогда
        КоличествоВыбранныхДат = 0;
        Возврат;
    КонецЕсли;

    КоличествоВыбранныхДат = 
        СписокВыбранныхДат.Количество();
	КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ТекущийСотрудник = ПолучитьСотрудникаТекущегоПользователя();  
		
	Если ПривелегированныйПользователь Тогда
		Элементы.Календарь.ТолькоПросмотр = Ложь;
		ПроверитьИзмененияИОбновить();
		Возврат;
	КонецЕсли;
	
	Если Объект.Сотрудник <> ТекущийСотрудник Тогда
		Сообщить("Сотрудник и пользователь не совпадают. Изменение календаря не возможно;");			
		Элементы.Календарь.ТолькоПросмотр = Истина;
		ПроверитьИзмененияИОбновить();
	Иначе
		Элементы.Календарь.ТолькоПросмотр = Ложь;
		ПроверитьИзмененияИОбновить();	
	КонецЕсли;   
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбновитьПериодКалендаря()

    Элементы.Календарь.НачалоПериодаОтображения =
        Дата(Объект.ВыбранныйГод,1,1);

    Элементы.Календарь.КонецПериодаОтображения =
        КонецГода(
            Дата(Объект.ВыбранныйГод,1,1));

		КонецПроцедуры
		
&НаСервере
Функция ВходитВМенеджерыПоПерсоналу(Пользователь)
	Группа = Справочники.ГруппыДоступа.НайтиПоНаименованию("Менеджер по персоналу");
	
	Если Группа.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Группа.Пользователи.Найти(Пользователь) <> Неопределено;
	
КонецФункции
